app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---
							<div class="col-xs-12 col-sm-2 post-info text-center">
								<p>Comments (<%= post.comments.count %>)</p>