app/views/posts/search.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---
								<div class="col-xs-2 post-info text-center">
									<p>Comments (<%= post.comments.count %>)</p>