app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---
<script>
$(function () {
	$('#box').keyup(function(){
	   var valThis = $(this).val().toLowerCase();
	    if(valThis == ""){
	        $('.comment').show().removeClass('result');
	    } else {
	        $('.comment').each(function(){
	            var text = $(this).text().toLowerCase();
	            var heading = $(this).find('h5').text().toLowerCase();
	            (heading.indexOf(valThis) >= 0) ? $(this).show().addClass('result') : $(this).hide().removeClass('result');
	        });
	   };
	});
});

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---
				<div class="col-xs-12 col-sm-8 text-left">
					<h4 style="text-align:left;">Comments (<%= @post.comments.count %>)</h4>