app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "description", "main_content", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "image_file_size" = $1, "image_updated_at" = $2, "image_file_name" = $3, "updated_at" = $4 WHERE "blogs"."id" = $5  [["image_file_size", 158764], ["image_updated_at", "2017-02-15 04:12:53.613840"], ["image_file_name", "img-listing-2.jpg"], ["updated_at", "2017-02-15 04:12:54.277440"], ["id", 2]]