app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("comment", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "My first comment"], ["post_id", 4], ["created_at", "2017-02-14 02:38:53.582981"], ["updated_at", "2017-02-14 02:38:53.582981"]]
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 2], ["updated_at", "2017-02-14 03:13:58.952541"], ["id", 3]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:comment))
		@comment.user_id = current_user.id if current_user
		@comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 4], ["id", 1]]
---
	def edit
		@post = Post.find(params[:post_id])
		@comment = @post.comments.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 4], ["id", 1]]
UPDATE "comments" SET "comment" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment", "My first comment, editted"], ["updated_at", "2017-02-14 03:07:46.104582"], ["id", 1]]
---
	def update
		@post = Post.find(params[:post_id])
		@comment = @post.comments.find(params[:id])
		if @comment.update(params[:comment].permit(:comment))