app/controllers/posts_controller.rb

	def search
		if params[:search].present?
			@posts = Post.where("lower(title) LIKE :search OR lower(content) LIKE :search", search: "%#{params[:search]}%".downcase) #TO LOWERCASE
---
SELECT "posts".* FROM "posts" WHERE (lower(title) LIKE '%lorem%' OR lower(content) LIKE '%lorem%')

	def index
		# @posts = Post.all.order("created_at DESC")
		@posts = Post.order("#{sort_column} #{sort_direction}")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

	def create
		@post = current_user.posts.build(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Give me an id"], ["content", "id me"], ["user_id", 1], ["created_at", "2017-02-12 04:03:23.895752"], ["updated_at", "2017-02-12 04:03:23.895752"]]