app/controllers/productlines_controller.rb

	def index
		@productlines = Productline.all.order("title ASC")
---
SELECT "productlines".* FROM "productlines" ORDER BY title DESC

	def new
		@productlines = Productline.all
---
SELECT "productlines".* FROM "productlines"

	def show
		@productline = Productline.find(params[:id])
---
SELECT  "productlines".* FROM "productlines" WHERE "productlines"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

	def create
		@productline = Productline.all.build(productline_params)
		@productline.user_id = current_user.id if current_user

		if @productline.save
---
INSERT INTO "productlines" ("textdescription", "created_at", "updated_at", "title", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["textdescription", "New"], ["created_at", 2017-02-21 03:07:22 UTC], ["updated_at", 2017-02-21 03:07:22 UTC], ["title", "New Product Line"], ["user_id", 1]]

	def update
		if @productline.update(productline_params)
---
UPDATE "productlines" SET "title" = $1, "updated_at" = $2 WHERE "productlines"."id" = $3  [["title", "Ships & Broats"], ["updated_at", 2017-02-21 02:48:20 UTC], ["id", 4]]

	def destroy
		@productline.destroy
---
DELETE FROM "productlines" WHERE "productlines"."id" = $1  [["id", 10]]

		def find_productline
			@productline = Productline.find(params[:id])
---
SELECT  "productlines".* FROM "productlines" WHERE "productlines"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]