app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY productname ASC
---
  def index
    @products = Product.all.order("productname ASC")

SELECT "productlines".* FROM "productlines"
SELECT "products".* FROM "products"
---
  def new
    @productlines = Productline.all
    @products = Product.all

INSERT INTO "products" ("productcode", "productname", "productscale", "productvendor", "productdescription", "quantityinstock", "buyprice", "msrp", "created_at", "updated_at", "productline_id", "image_file_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @product = Product.all.build(product_params)

    if @product.save