app/controllers/welcome_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def homepage
  	@blogs = Blog.all